ams/src/InformationRegisters/ДатаМобайл_ПорционнаяВыгрузка/ДатаМобайл_ПорционнаяВыгрузка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатаМобайл_ПорционнаяВыгрузка</name>
  <dimensions>
    <name>ТСД</name>
    <type>
      <types>ExchangePlanRef.ДатаМобайл_СписокТСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОбъекта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектВыгрузки</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ДатаМобайл_НовыеТовары</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ams/src/InformationRegisters/ДатаМобайл_ПорционнаяВыгрузка/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

#Область Номенклатура 

Процедура ЗарегистрироватьНоменклатуруДокументаПодПорционнуюВыгрузку(УзелПО, СписокНоменклатуры) Экспорт
	
	// 1. Очищаем регистр от возможных данных с других обменов:
	
	НаборЗаписей = РегистрыСведений.ДатаМобайл_ПорционнаяВыгрузка.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ТСД.Установить(УзелПО);
	// 1-товары
	НаборЗаписей.Отбор.ТипОбъекта.Установить(1);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить(); 
	НаборЗаписей.Записать(Истина);  
	
	КоличествоТоваровВПорции = УзелПО.КоличествоТоваровВПорции;
	Если Не ЗначениеЗаполнено(КоличествоТоваровВПорции) Тогда
		КоличествоТоваровВПорции = 1000;
	КонецЕсли;	
	
	// 2. Запрашиваем данные:  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК ОбъектВыгрузки
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ПометкаУдаления           
	|	И Номенклатура.ТипНоменклатуры = &ТипНоменклатуры
	|	И Номенклатура.Ссылка В (&СписокНоменклатуры)";                          
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	Запрос.УстановитьПараметр("ТипНоменклатуры", Перечисления.ТипыНоменклатуры.Товар);
	
	Результат = Запрос.Выполнить(); 
	
	// 3. Регистрируем под выгрузку:
	
	НомерПакетаДляРегистрации = 1;
	
	ВыборкаДанныхДляРегистрации = Результат.Выбрать();
	КоличествоТоваровВТекущейПорции = 0;
	
	МассивТоваровВПорции = Новый Массив;
	
	// создаем набор записей:  
	
	НаборЗаписей = РегистрыСведений.ДатаМобайл_ПорционнаяВыгрузка.СоздатьНаборЗаписей();
	
	Пока ВыборкаДанныхДляРегистрации.Следующий() Цикл 
		
		// сравниваем настройку с  количеством товаров в текущей порции:	
		
		Если (КоличествоТоваровВТекущейПорции + 1) = КоличествоТоваровВПорции Тогда
			
			МассивТоваровВПорции.Добавить(ВыборкаДанныхДляРегистрации.ОбъектВыгрузки);
			
			НаборЗаписей.Отбор.ТСД.Установить(УзелПО); 
			НаборЗаписей.Отбор.НомерПакета.Установить(НомерПакетаДляРегистрации);
			// 1-товары
			НаборЗаписей.Отбор.ТипОбъекта.Установить(1);
			НаборЗаписей.Прочитать();
			
			Для каждого ЭлементМассива Из МассивТоваровВПорции Цикл
				
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.ТСД = УзелПО;
				НоваяЗапись.ОбъектВыгрузки = ЭлементМассива;
				НоваяЗапись.НомерПакета = НомерПакетаДляРегистрации;
				НоваяЗапись.ТипОбъекта = 1;   
				
			КонецЦикла;
			
			// сбрасываем счетчик товаров в порции:	
			КоличествоТоваровВТекущейПорции = 0;
			// берем номер следующего пакета:
			НомерПакетаДляРегистрации = НомерПакетаДляРегистрации + 1;
			// очищаем массив товаров в порции:
			МассивТоваровВПорции.Очистить();
			
			// записываем данные текущей порции:
			НаборЗаписей.Записать(Истина);  
			
		Иначе
			
			МассивТоваровВПорции.Добавить(ВыборкаДанныхДляРегистрации.ОбъектВыгрузки);
			КоличествоТоваровВТекущейПорции = КоличествоТоваровВТекущейПорции + 1;
			
		КонецЕсли;   					
		
	КонецЦикла;	
	
	// записываем остатки последней порции:
	Если МассивТоваровВПорции.Количество() Тогда
		
		НаборЗаписей.Отбор.ТСД.Установить(УзелПО); 
		НаборЗаписей.Отбор.НомерПакета.Установить(НомерПакетаДляРегистрации);
		// 1-товары
		НаборЗаписей.Отбор.ТипОбъекта.Установить(1);
		НаборЗаписей.Прочитать();
		
		Для каждого ЭлементМассива Из МассивТоваровВПорции Цикл
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.ТСД = УзелПО;
			НоваяЗапись.ОбъектВыгрузки = ЭлементМассива;
			НоваяЗапись.НомерПакета = НомерПакетаДляРегистрации;
			НоваяЗапись.ТипОбъекта = 1;   
			
		КонецЦикла;
		
		НаборЗаписей.Записать(Истина);
		
		МассивТоваровВПорции.Очистить();
		
	КонецЕсли;	  		
	
КонецПроцедуры	

Процедура ЗарегистрироватьНоменклатуруПодПорционнуюВыгрузку(УзелПО, Значение) Экспорт
	
	Если Значение Тогда
		
		ДатаМобайл_ОбщийМодуль.СообщитьПользователю("Регистрация товаров под выгрузку...");
		
		// 1. Очищаем регистр от возможных данных с других обменов:
		
		НаборЗаписей = РегистрыСведений.ДатаМобайл_ПорционнаяВыгрузка.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ТСД.Установить(УзелПО);
		// 1-товары
		НаборЗаписей.Отбор.ТипОбъекта.Установить(1);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить(); 
		НаборЗаписей.Записать(Истина);  
		
		КоличествоТоваровВПорции = УзелПО.КоличествоТоваровВПорции;
		Если Не ЗначениеЗаполнено(КоличествоТоваровВПорции) Тогда
			КоличествоТоваровВПорции = 1000;
		КонецЕсли;	
		
		// 2. Запрашиваем данные:  

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК ОбъектВыгрузки
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ПометкаУдаления           
		|	И Номенклатура.ТипНоменклатуры = &ТипНоменклатуры
		|	И (&ВсеТоварыВыбраннойГруппы
		|			ИЛИ Номенклатура.Ссылка В ИЕРАРХИИ (&ВыбраннаяГруппаТоваров))
		|	И НЕ Номенклатура.ЭтоГруппа";                          
		Запрос.УстановитьПараметр("ВыбраннаяГруппаТоваров", УзелПО.ДоступныеГруппыТоваров.ВыгрузитьКолонку("Номенклатура"));
		Запрос.УстановитьПараметр("ВсеТоварыВыбраннойГруппы", УзелПО.ДоступныеГруппыТоваров.Количество() = 0);
		Запрос.УстановитьПараметр("ТипНоменклатуры", Перечисления.ТипыНоменклатуры.Товар);
		
		Результат = Запрос.Выполнить(); 
		
		// 3. Регистрируем под выгрузку:
		
		НомерПакетаДляРегистрации = 1;
		
		ВыборкаДанныхДляРегистрации = Результат.Выбрать();
		КоличествоТоваровВТекущейПорции = 0;
		
		МассивТоваровВПорции = Новый Массив;
		
		// создаем набор записей:  
		
		НаборЗаписей = РегистрыСведений.ДатаМобайл_ПорционнаяВыгрузка.СоздатьНаборЗаписей();
		
		Пока ВыборкаДанныхДляРегистрации.Следующий() Цикл 
			
			// сравниваем настройку с  количеством товаров в текущей порции:	
			
			Если (КоличествоТоваровВТекущейПорции + 1) = КоличествоТоваровВПорции Тогда
				
				МассивТоваровВПорции.Добавить(ВыборкаДанныхДляРегистрации.ОбъектВыгрузки);
				
				НаборЗаписей.Отбор.ТСД.Установить(УзелПО); 
				НаборЗаписей.Отбор.НомерПакета.Установить(НомерПакетаДляРегистрации);
				// 1-товары
				НаборЗаписей.Отбор.ТипОбъекта.Установить(1);
				НаборЗаписей.Прочитать();
				
				Для каждого ЭлементМассива Из МассивТоваровВПорции Цикл
					
					НоваяЗапись = НаборЗаписей.Добавить();
					НоваяЗапись.ТСД = УзелПО;
					НоваяЗапись.ОбъектВыгрузки = ЭлементМассива;
					НоваяЗапись.НомерПакета = НомерПакетаДляРегистрации;
					НоваяЗапись.ТипОбъекта = 1;   
					
				КонецЦикла;
				
				// сбрасываем счетчик товаров в порции:	
				КоличествоТоваровВТекущейПорции = 0;
				// берем номер следующего пакета:
				НомерПакетаДляРегистрации = НомерПакетаДляРегистрации + 1;
				// очищаем массив товаров в порции:
				МассивТоваровВПорции.Очистить();
				
				// записываем данные текущей порции:
				НаборЗаписей.Записать(Истина);  
				
			Иначе
				
				МассивТоваровВПорции.Добавить(ВыборкаДанныхДляРегистрации.ОбъектВыгрузки);
				КоличествоТоваровВТекущейПорции = КоличествоТоваровВТекущейПорции + 1;
				
			КонецЕсли;   					
			
		КонецЦикла;	
		
		// записываем остатки последней порции:
		Если МассивТоваровВПорции.Количество() Тогда
			
			НаборЗаписей.Отбор.ТСД.Установить(УзелПО); 
			НаборЗаписей.Отбор.НомерПакета.Установить(НомерПакетаДляРегистрации);
			// 1-товары
			НаборЗаписей.Отбор.ТипОбъекта.Установить(1);
			НаборЗаписей.Прочитать();
			
			Для каждого ЭлементМассива Из МассивТоваровВПорции Цикл
				
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.ТСД = УзелПО;
				НоваяЗапись.ОбъектВыгрузки = ЭлементМассива;
				НоваяЗапись.НомерПакета = НомерПакетаДляРегистрации;
				НоваяЗапись.ТипОбъекта = 1;   
				
			КонецЦикла;
			
			НаборЗаписей.Записать(Истина);
			
			МассивТоваровВПорции.Очистить();
			
		КонецЕсли;	  		
		
		
		
		ДатаМобайл_ОбщийМодуль.СообщитьПользователю("Регистрация товаров завершена!");   
		
	Иначе
		
		НаборЗаписей = РегистрыСведений.ДатаМобайл_ПорционнаяВыгрузка.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ТСД.Установить(УзелПО); 
		// 1-товары
		НаборЗаписей.Отбор.ТипОбъекта.Установить(1);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить(); 
		
		НаборЗаписей.Записать(Истина);     
		
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ПеререгистрацияПодвисшихПакетовПодВыгрузку(УзелПО) Экспорт  
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДатаМобайл_ПорционнаяВыгрузка.НомерПакета
	|ИЗ
	|	РегистрСведений.ДатаМобайл_ПорционнаяВыгрузка КАК ДатаМобайл_ПорционнаяВыгрузка
	|ГДЕ
	|	ДатаМобайл_ПорционнаяВыгрузка.ТСД = &ТСД";
	Запрос.УстановитьПараметр("ТСД", УзелПО);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	СчетчикНовыхПакетов = 1;
	
	Пока Выборка.Следующий() Цикл    
		
		НаборЗаписейПодвисшегоПакета = РегистрыСведений.ДатаМобайл_ПорционнаяВыгрузка.СоздатьНаборЗаписей();
		НаборЗаписейПодвисшегоПакета.Отбор.ТСД.Установить(УзелПО);
		НаборЗаписейПодвисшегоПакета.Отбор.НомерПакета.Установить(Выборка.НомерПакета);
		НаборЗаписейПодвисшегоПакета.Прочитать();
		
		НаборЗаписейНовый = РегистрыСведений.ДатаМобайл_ПорционнаяВыгрузка.СоздатьНаборЗаписей();
		НаборЗаписейНовый.Отбор.ТСД.Установить(УзелПО);
		НаборЗаписейНовый.Отбор.НомерПакета.Установить(СчетчикНовыхПакетов);
		НаборЗаписейНовый.Прочитать();
		НаборЗаписейНовый.Очистить();
		
		Для каждого Запись Из НаборЗаписейПодвисшегоПакета Цикл
			
			НоваяЗапись = НаборЗаписейНовый.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Запись);
			НоваяЗапись.НомерПакета = СчетчикНовыхПакетов;
			
		КонецЦикла;	
		
		НаборЗаписейНовый.Записать(Истина);
		
		НаборЗаписейПодвисшегоПакета.Очистить();
		НаборЗаписейПодвисшегоПакета.Записать(Истина);
		
		СчетчикНовыхПакетов = СчетчикНовыхПакетов + 1;
		
	КонецЦикла;	
	

	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	ДатаМобайл_ПорционнаяВыгрузка.ТСД,
	|	ДатаМобайл_ПорционнаяВыгрузка.НомерПакета,
	|	ДатаМобайл_ПорционнаяВыгрузка.ТипОбъекта,
	|	ДатаМобайл_ПорционнаяВыгрузка.ОбъектВыгрузки
	|ИЗ
	|	РегистрСведений.ДатаМобайл_ПорционнаяВыгрузка КАК ДатаМобайл_ПорционнаяВыгрузка
	|ГДЕ
	|	ДатаМобайл_ПорционнаяВыгрузка.ТСД = &ТСД";
	Запрос.УстановитьПараметр("ТСД", УзелПО);
	
	
	
КонецПроцедуры

Процедура ЗарегистрироватьИзображенияНоменклатурыПодПорционнуюВыгрузку(УзелПО, Значение) Экспорт
	
	Если Значение Тогда
		
		ДатаМобайл_ОбщийМодуль.СообщитьПользователю("Регистрация изображений товаров под выгрузку...");
		
		// 1. Очищаем регистр от возможных данных с других обменов:
		
		НаборЗаписей = РегистрыСведений.ДатаМобайл_ПорционнаяВыгрузка.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ТСД.Установить(УзелПО);
		// 1-товары
		НаборЗаписей.Отбор.ТипОбъекта.Установить(2);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить(); 
		НаборЗаписей.Записать(Истина);  
		
		КоличествоИзображенийВПорции = УзелПО.КоличествоИзображенийВПорции;
		
		Если Не ЗначениеЗаполнено(КоличествоИзображенийВПорции) Тогда
			КоличествоИзображенийВПорции = 10;
		КонецЕсли;	             
		
		// 2. Запрашиваем данные:
		
		Запрос = Новый Запрос;	
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Файлы.Ссылка КАК ОбъектВыгрузки
		|ИЗ
		|	Справочник.НоменклатураПрисоединенныеФайлы КАК Файлы
		|ГДЕ
		|	НЕ Файлы.ПометкаУдаления
		|	И НЕ Файлы.ВладелецФайла.ПометкаУдаления 
		|	И Файлы.Расширение В(&Расширения)
		|	И Файлы.ВладелецФайла.ТипНоменклатуры = &ТипНоменклатуры
		|	И (&ВсеТоварыВыбраннойГруппы
		|			ИЛИ Файлы.ВладелецФайла В ИЕРАРХИИ (&ВыбраннаяГруппаТоваров))"; 
		
		МассивРасширений = Новый Массив;
		МассивРасширений.Добавить("jpg");
		МассивРасширений.Добавить("jpeg");
		МассивРасширений.Добавить("bmp");
		МассивРасширений.Добавить("png"); 
		МассивРасширений.Добавить("jfif");  
		
		Запрос.УстановитьПараметр("Расширения", МассивРасширений);   		
        Запрос.УстановитьПараметр("ВыбраннаяГруппаТоваров", УзелПО.ДоступныеГруппыТоваров.ВыгрузитьКолонку("Номенклатура"));
		Запрос.УстановитьПараметр("ВсеТоварыВыбраннойГруппы", УзелПО.ДоступныеГруппыТоваров.Количество() = 0);
		Запрос.УстановитьПараметр("ТипНоменклатуры", Перечисления.ТипыНоменклатуры.Товар);                         
				
		Результат = Запрос.Выполнить(); 
		
		// 3. Регистрируем под выгрузку:
		
		НомерПакетаДляРегистрации = 1;
		
		ВыборкаДанныхДляРегистрации = Результат.Выбрать();
		КоличествоИзображенийНоменклатурыВТекущейПорции = 0;
		
		МассивИзображенийНоменклатурыВПорции = Новый Массив;
		
		// создаем набор записей:  
		
		НаборЗаписей = РегистрыСведений.ДатаМобайл_ПорционнаяВыгрузка.СоздатьНаборЗаписей();
		
		Пока ВыборкаДанныхДляРегистрации.Следующий() Цикл 
			
			// сравниваем настройку с  количеством товаров в текущей порции:	
			
			Если (КоличествоИзображенийНоменклатурыВТекущейПорции + 1) = КоличествоИзображенийВПорции Тогда
				
				МассивИзображенийНоменклатурыВПорции.Добавить(ВыборкаДанныхДляРегистрации.ОбъектВыгрузки);
				
				НаборЗаписей.Отбор.ТСД.Установить(УзелПО); 
				НаборЗаписей.Отбор.НомерПакета.Установить(НомерПакетаДляРегистрации);
				// 1-товары
				НаборЗаписей.Отбор.ТипОбъекта.Установить(2);
				НаборЗаписей.Прочитать();
				
				Для Каждого ЭлементМассива Из МассивИзображенийНоменклатурыВПорции Цикл
					
					НоваяЗапись = НаборЗаписей.Добавить();
					НоваяЗапись.ТСД = УзелПО;
					НоваяЗапись.ОбъектВыгрузки = ЭлементМассива;
					НоваяЗапись.НомерПакета = НомерПакетаДляРегистрации;
					НоваяЗапись.ТипОбъекта = 2;   
					
				КонецЦикла;
				
				// сбрасываем счетчик товаров в порции:	
				КоличествоИзображенийНоменклатурыВТекущейПорции = 0;
				// берем номер следующего пакета:
				НомерПакетаДляРегистрации = НомерПакетаДляРегистрации + 1;
				// очищаем массив товаров в порции:
				МассивИзображенийНоменклатурыВПорции.Очистить();
				
				// записываем данные текущей порции:
				НаборЗаписей.Записать(Истина);  
				
			Иначе
				
				МассивИзображенийНоменклатурыВПорции.Добавить(ВыборкаДанныхДляРегистрации.ОбъектВыгрузки);
				КоличествоИзображенийНоменклатурыВТекущейПорции = КоличествоИзображенийНоменклатурыВТекущейПорции + 1;
				
			КонецЕсли;   					
			
		КонецЦикла;	
		
		// записываем остатки последней порции:
		Если МассивИзображенийНоменклатурыВПорции.Количество() Тогда
			
			НаборЗаписей.Отбор.ТСД.Установить(УзелПО); 
			НаборЗаписей.Отбор.НомерПакета.Установить(НомерПакетаДляРегистрации);
			// 1-товары
			НаборЗаписей.Отбор.ТипОбъекта.Установить(2);
			НаборЗаписей.Прочитать();
			
			Для каждого ЭлементМассива Из МассивИзображенийНоменклатурыВПорции Цикл
				
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.ТСД = УзелПО;
				НоваяЗапись.ОбъектВыгрузки = ЭлементМассива;
				НоваяЗапись.НомерПакета = НомерПакетаДляРегистрации;
				НоваяЗапись.ТипОбъекта = 2;   
				
			КонецЦикла;
			
			НаборЗаписей.Записать(Истина);
			
			МассивИзображенийНоменклатурыВПорции.Очистить();
			
		КонецЕсли;	  		
		
		ДатаМобайл_ОбщийМодуль.СообщитьПользователю("Регистрация изображений товаров завершена!");   
		
	Иначе
		
		НаборЗаписей = РегистрыСведений.ДатаМобайл_ПорционнаяВыгрузка.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ТСД.Установить(УзелПО); 
		// 1-товары
		НаборЗаписей.Отбор.ТипОбъекта.Установить(2);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить(); 
		
		НаборЗаписей.Записать(Истина);     
		
	КонецЕсли;	
	
КонецПроцедуры	

#КонецОбласти

#Область Контрагенты  

Процедура ЗарегистрироватьКонтрагентовПодПорционнуюВыгрузку(УзелПО, Значение) Экспорт
	
	Если Значение Тогда
		
		ДатаМобайл_ОбщийМодуль.СообщитьПользователю("Регистрация контрагентов под выгрузку...");
		
		// 1. Очищаем регистр от возможных данных с других обменов:
		
		НаборЗаписей = РегистрыСведений.ДатаМобайл_ПорционнаяВыгрузка.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ТСД.Установить(УзелПО);
		// 1-товары
		НаборЗаписей.Отбор.ТипОбъекта.Установить(3);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить(); 
		НаборЗаписей.Записать(Истина);  
		
		КоличествоКонтрагентовВПорции = УзелПО.КоличествоКонтрагентовВПорции;
		Если Не ЗначениеЗаполнено(КоличествоКонтрагентовВПорции) Тогда
			КоличествоКонтрагентовВПорции = 1000;
		КонецЕсли;	
		
		// 2. Запрашиваем данные:  

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПартнерыСправочник.Ссылка КАК ОбъектВыгрузки
		|ИЗ
		|	Справочник.Партнеры КАК ПартнерыСправочник
		|ГДЕ
		|	НЕ ПартнерыСправочник.ПометкаУдаления           
		|	И (&ВсеКонтрагенты ИЛИ ПартнерыСправочник.Ссылка В ИЕРАРХИИ (&Контрагенты))";                          
		
		СписокКонтрагентов = УзелПО.Контрагенты.ВыгрузитьКолонку("Контрагент");
		Запрос.УстановитьПараметр("Контрагенты", СписокКонтрагентов);	
		Запрос.УстановитьПараметр("ВсеКонтрагенты", СписокКонтрагентов.Количество() = 0);		
		Результат = Запрос.Выполнить(); 
		
		// 3. Регистрируем под выгрузку:
		
		НомерПакетаДляРегистрации = 1;
		
		ВыборкаДанныхДляРегистрации = Результат.Выбрать();
		КоличествоКонтрагентовВТекущейПорции = 0;
		
		МассивКонтрагентовВПорции = Новый Массив;
		
		// создаем набор записей:  
		
		НаборЗаписей = РегистрыСведений.ДатаМобайл_ПорционнаяВыгрузка.СоздатьНаборЗаписей();
		
		Пока ВыборкаДанныхДляРегистрации.Следующий() Цикл 
			
			// сравниваем настройку с  количеством контрагентов в текущей порции:	
			
			Если (КоличествоКонтрагентовВТекущейПорции + 1) = КоличествоКонтрагентовВПорции Тогда
				
				МассивКонтрагентовВПорции.Добавить(ВыборкаДанныхДляРегистрации.ОбъектВыгрузки);
				
				НаборЗаписей.Отбор.ТСД.Установить(УзелПО); 
				НаборЗаписей.Отбор.НомерПакета.Установить(НомерПакетаДляРегистрации);
				// 3-контаргенты
				НаборЗаписей.Отбор.ТипОбъекта.Установить(3);
				НаборЗаписей.Прочитать();
				
				Для каждого ЭлементМассива Из МассивКонтрагентовВПорции Цикл
					
					НоваяЗапись = НаборЗаписей.Добавить();
					НоваяЗапись.ТСД = УзелПО;
					НоваяЗапись.ОбъектВыгрузки = ЭлементМассива;
					НоваяЗапись.НомерПакета = НомерПакетаДляРегистрации;
					НоваяЗапись.ТипОбъекта = 3;   
					
				КонецЦикла;
				
				// сбрасываем счетчик товаров в порции:	
				КоличествоКонтрагентовВТекущейПорции = 0;
				// берем номер следующего пакета:
				НомерПакетаДляРегистрации = НомерПакетаДляРегистрации + 1;
				// очищаем массив товаров в порции:
				МассивКонтрагентовВПорции.Очистить();
				
				// записываем данные текущей порции:
				НаборЗаписей.Записать(Истина);  
				
			Иначе
				
				МассивКонтрагентовВПорции.Добавить(ВыборкаДанныхДляРегистрации.ОбъектВыгрузки);
				КоличествоКонтрагентовВТекущейПорции = КоличествоКонтрагентовВТекущейПорции + 1;
				
			КонецЕсли;   					
			
		КонецЦикла;	
		
		// записываем остатки последней порции:
		Если МассивКонтрагентовВПорции.Количество() Тогда
			
			НаборЗаписей.Отбор.ТСД.Установить(УзелПО); 
			НаборЗаписей.Отбор.НомерПакета.Установить(НомерПакетаДляРегистрации);
			// 3-товары
			НаборЗаписей.Отбор.ТипОбъекта.Установить(3);
			НаборЗаписей.Прочитать();
			
			Для каждого ЭлементМассива Из МассивКонтрагентовВПорции Цикл
				
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.ТСД = УзелПО;
				НоваяЗапись.ОбъектВыгрузки = ЭлементМассива;
				НоваяЗапись.НомерПакета = НомерПакетаДляРегистрации;
				НоваяЗапись.ТипОбъекта = 3;   
				
			КонецЦикла;
			
			НаборЗаписей.Записать(Истина);
			
			МассивКонтрагентовВПорции.Очистить();
			
		КонецЕсли;	  		
		
		
		
		ДатаМобайл_ОбщийМодуль.СообщитьПользователю("Регистрация контрагентов завершена!");   
		
	Иначе
		
		НаборЗаписей = РегистрыСведений.ДатаМобайл_ПорционнаяВыгрузка.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ТСД.Установить(УзелПО); 
		// 3-товары
		НаборЗаписей.Отбор.ТипОбъекта.Установить(3);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить(); 
		
		НаборЗаписей.Записать(Истина);     
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
